{
  "contestId": 1523,
  "index": "A",
  "name": "Game of Life",
  "rating": 800,
  "tags": [
    "implementation"
  ],
  "statement": "William really likes the cellular automaton called \"Game of Life\" so he decided to make his own version. For simplicity, William decided to define his cellular automaton on an array containing $$$n$$$ cells, with each cell either being alive or dead. Evolution of the array in William's cellular automaton occurs iteratively in the following way: If the element is dead and it has exactly $$$1$$$ alive neighbor in the current state of the array , then on the next iteration it will become alive. For an element at index $$$i$$$ the neighbors would be elements with indices $$$i - 1$$$ and $$$i + 1$$$. If there is no element at that index, it is considered to be a dead neighbor. William is a humane person so all alive elements stay alive. Check the note section for examples of the evolution. You are given some initial state of all elements and you need to help William find the state of the array after $$$m$$$ iterations of evolution.",
  "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\le t \\le 10^3$$$). Description of the test cases follows. The first line of each test case contains two integers $$$n$$$ and $$$m$$$ ($$$2 \\le n \\le 10^3, 1 \\le m \\le 10^9$$$), which are the total number of cells in the array and the number of iterations. The second line of each test case contains a string of length $$$n$$$ made up of characters \" 0 \" and \" 1 \" and defines the initial state of the array. \" 1 \" means a cell is alive and \" 0 \" means it is dead. It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$10^4$$$.",
  "outputFormat": "In each test case output a string of length $$$n$$$, made up of characters \" 0 \" and \" 1 \" — the state of the array after $$$m$$$ iterations of evolution.",
  "sampleTests": [
    {
      "input": "4\n11 3\n01000000001\n10 2\n0110100101\n5 2\n10101\n3 100\n000",
      "output": "11111001111\n1110111101\n10101\n000"
    }
  ],
  "timeLimit": 1000,
  "memoryLimit": 256,
  "sourceUrl": "https://codeforces.com/problemset/problem/1523/A",
  "verified": true,
  "qualityScore": 4.0,
  "source": "codeforces-scraped"
}