{
  "contestId": 1566,
  "index": "G",
  "name": "Four Vertices",
  "rating": 3100,
  "tags": [
    "implementation"
  ],
  "statement": "You are given an undirected weighted graph, consisting of $$$n$$$ vertices and $$$m$$$ edges. Some queries happen with this graph: Delete an existing edge from the graph. Add a non-existing edge to the graph. At the beginning and after each query, you should find four different vertices $$$a$$$, $$$b$$$, $$$c$$$, $$$d$$$ such that there exists a path between $$$a$$$ and $$$b$$$, there exists a path between $$$c$$$ and $$$d$$$, and the sum of lengths of two shortest paths from $$$a$$$ to $$$b$$$ and from $$$c$$$ to $$$d$$$ is minimal. The answer to the query is the sum of the lengths of these two shortest paths. The length of the path is equal to the sum of weights of edges in this path.",
  "inputFormat": "The first line contains two integers $$$n$$$ and $$$m$$$ $$$(4 \\le n, m \\le 10^5)$$$ — the number of vertices and edges in the graph respectively. Each of the next $$$m$$$ lines contain three integers $$$v$$$, $$$u$$$, $$$w$$$ ($$$1 \\le v, u \\le n, v \\neq u$$$, $$$1 \\le w \\le 10^9$$$) — this triple means that there is an edge between vertices $$$v$$$ and $$$u$$$ with weight $$$w$$$. The next line contains a single integer $$$q$$$ $$$(0 \\le q \\le 10^5)$$$ — the number of queries. The next $$$q$$$ lines contain the queries of two types: $$$0$$$ $$$v$$$ $$$u$$$ — this query means deleting an edge between $$$v$$$ and $$$u$$$ $$$(1 \\le v, u \\le n, v \\neq u)$$$. It is guaranteed that such edge exists in the graph. $$$1$$$ $$$v$$$ $$$u$$$ $$$w$$$ — this query means adding an edge between vertices $$$v$$$ and $$$u$$$ with weight $$$w$$$ ($$$1 \\le v, u \\le n, v \\neq u$$$, $$$1 \\le w \\le 10^9$$$). It is guaranteed that there was no such edge in the graph. It is guaranteed that the initial graph does not contain multiple edges. At the beginning and after each query, the graph doesn't need to be connected. It is guaranteed that at each moment the number of edges will be at least $$$4$$$ . It can be proven, that at each moment there exist some four vertices $$$a$$$, $$$b$$$, $$$c$$$, $$$d$$$ such that there exists a path between vertices $$$a$$$ and $$$b$$$, and there exists a path between vertices $$$c$$$ and $$$d$$$.",
  "outputFormat": "Print $$$q + 1$$$ integers — the minimal sum of lengths of shortest paths between chosen pairs of vertices before the queries and after each of them.",
  "sampleTests": [
    {
      "input": "6 6\n1 3 6\n4 3 1\n1 4 1\n2 6 4\n2 4 2\n5 4 3\n4\n1 2 5 2\n0 1 4\n0 3 4\n1 6 1 3",
      "output": "4\n3\n3\n7\n5"
    }
  ],
  "timeLimit": 2000,
  "memoryLimit": 256,
  "sourceUrl": "https://codeforces.com/problemset/problem/1566/G",
  "verified": true,
  "qualityScore": 4.0,
  "source": "codeforces-scraped"
}