{
  "contestId": 1571,
  "index": "D",
  "name": "Sweepstake",
  "rating": 1800,
  "tags": [
    "implementation"
  ],
  "statement": "Kotlin Heroes competition is nearing completion. This time $$$n$$$ programmers took part in the competition. Now organizers are thinking how to entertain spectators as well. One of the possibilities is holding sweepstakes. So for now they decided to conduct a survey among spectators. In total, organizers asked $$$m$$$ viewers two questions: Who will take the first place? Who will take the last place? After receiving answers, organizers ranked all spectators based on the number of programmers they guessed right. Suppose, there are $$$c_2$$$ viewers who guessed right both first and last place, $$$c_1$$$ viewers who guessed either first or last place right and $$$c_0$$$ viewers who didn't guess at all. All $$$c_2$$$ viewers will get rank $$$1$$$, all viewers with one right answer will get rank $$$c_2 + 1$$$ and all remaining viewers — rank $$$c_2 + c_1 + 1$$$. You were one of the interviewed spectators. Also, as one of the organizers, you have access to survey results, but not to competition results. Calculate, what is the worst rank you can possibly get according to organizers' ranking system?",
  "inputFormat": "The first line contains two integers $$$n$$$ and $$$m$$$ ($$$2 \\le n \\le 1000$$$; $$$1 \\le m \\le 2 \\cdot 10^5$$$) — the number of programmers participating in the competition and the number of surveyed spectators. Next $$$m$$$ lines contain answers of spectators. The $$$i$$$-th line contains two integers $$$f_i$$$ and $$$l_i$$$ ($$$1 \\le f_i, l_i \\le n$$$; $$$f_i \\ne l_i$$$) — the indices of programmers who will take the first and last places in opinion of the $$$i$$$-th viewer. For simplicity, you are the first among spectators, so your answers are $$$f_1$$$ and $$$l_1$$$.",
  "outputFormat": "Print the single integer — the worst rank among spectators you can possibly get according to organizers' ranking system (bigger rank — worse, of course).",
  "sampleTests": [
    {
      "input": "2 3\n1 2\n2 1\n2 1",
      "output": "3"
    }
  ],
  "timeLimit": 2000,
  "memoryLimit": 256,
  "sourceUrl": "https://codeforces.com/problemset/problem/1571/D",
  "verified": true,
  "qualityScore": 4.0,
  "source": "codeforces-scraped"
}