{
  "contestId": 1615,
  "index": "E",
  "name": "Purple Crayon",
  "rating": 2400,
  "tags": [
    "implementation"
  ],
  "statement": "Two players, Red and Blue, are at it again, and this time they're playing with crayons! The mischievous duo is now vandalizing a rooted tree, by coloring the nodes while playing their favorite game. The game works as follows: there is a tree of size $$$n$$$, rooted at node $$$1$$$, where each node is initially white. Red and Blue get one turn each . Red goes first. In Red's turn, he can do the following operation any number of times : Pick any subtree of the rooted tree, and color every node in the subtree red. However, to make the game fair, Red is only allowed to color $$$k$$$ nodes of the tree. In other words, after Red's turn, at most $$$k$$$ of the nodes can be colored red. Then, it's Blue's turn. Blue can do the following operation any number of times : Pick any subtree of the rooted tree, and color every node in the subtree blue. However, he's not allowed to choose a subtree that contains a node already colored red, as that would make the node purple and no one likes purple crayon. Note: there's no restriction on the number of nodes Blue can color, as long as he doesn't color a node that Red has already colored. After the two turns, the score of the game is determined as follows: let $$$w$$$ be the number of white nodes, $$$r$$$ be the number of red nodes, and $$$b$$$ be the number of blue nodes. The score of the game is $$$w \\cdot (r - b)$$$. Red wants to maximize this score, and Blue wants to minimize it. If both players play optimally, what will the final score of the game be?",
  "inputFormat": "The first line contains two integers $$$n$$$ and $$$k$$$ ($$$2 \\le n \\le 2 \\cdot 10^5$$$; $$$1 \\le k \\le n$$$) — the number of vertices in the tree and the maximum number of red nodes. Next $$$n - 1$$$ lines contains description of edges. The $$$i$$$-th line contains two space separated integers $$$u_i$$$ and $$$v_i$$$ ($$$1 \\le u_i, v_i \\le n$$$; $$$u_i \\neq v_i$$$) — the $$$i$$$-th edge of the tree. It's guaranteed that given edges form a tree.",
  "outputFormat": "Print one integer — the resulting score if both Red and Blue play optimally.",
  "sampleTests": [
    {
      "input": "4 2\n1 2\n1 3\n1 4",
      "output": "1"
    }
  ],
  "timeLimit": 2000,
  "memoryLimit": 256,
  "sourceUrl": "https://codeforces.com/problemset/problem/1615/E",
  "verified": true,
  "qualityScore": 4.0,
  "source": "codeforces-scraped"
}