{
  "contestId": 1749,
  "index": "B",
  "name": "Death's Blessing",
  "rating": 900,
  "tags": [
    "implementation"
  ],
  "statement": "You are playing a computer game. To pass the current level, you have to kill a big horde of monsters. In this horde, there are $$$n$$$ monsters standing in the row, numbered from $$$1$$$ to $$$n$$$. The $$$i$$$-th monster has $$$a_i$$$ health and a special \"Death's Blessing\" spell of strength $$$b_i$$$ attached to it. You are going to kill all of them one by one . It takes exactly $$$h$$$ seconds to kill a monster with health $$$h$$$. When the $$$i$$$-th monster dies, it casts its spell that increases the health of its neighbors by $$$b_i$$$ (the neighbors of the $$$j$$$-th monster in the row are the monsters on places $$$j - 1$$$ and $$$j + 1$$$. The first and the last monsters have only one neighbor each). After each monster is killed, the row shrinks, so its former neighbors become adjacent to each other (so if one of them dies, the other one is affected by its spell). For example, imagine a situation with $$$4$$$ monsters with health $$$a = [2, 6, 7, 3]$$$ and spells $$$b = [3, 6, 0, 5]$$$. One of the ways to get rid of the monsters is shown below: $$$2$$$ $$$6$$$ $$$7$$$ $$$3$$$ $$$\\xrightarrow{6\\ s}$$$ $$$8$$$ $$$13$$$ $$$3$$$ $$$\\xrightarrow{13\\ s}$$$ $$$8$$$ $$$3$$$ $$$\\xrightarrow{8\\ s}$$$ $$$6$$$ $$$\\xrightarrow{6\\ s}$$$ $$$\\{\\}$$$ $$$3$$$ $$$6$$$ $$$0$$$ $$$5$$$ $$$3$$$ $$$0$$$ $$$5$$$ $$$3$$$ $$$5$$$ $$$5$$$ The first row represents the health of each monster, the second one — the power of the spells. As a result, we can kill all monsters in $$$6 + 13 + 8 + 6$$$ $$$=$$$ $$$33$$$ seconds. Note that it's only an example and may not be the fastest way to get rid of the monsters. What is the minimum time required to kill all monsters in the row?",
  "inputFormat": "The first line contains a single integer $$$t$$$ ($$$1 \\le t \\le 10^4$$$) — the number of test cases. The first line of each test case contains a single integer $$$n$$$ ($$$1 \\le n \\le 2 \\cdot 10^5$$$) — the number of monsters in the row. The second line contains $$$n$$$ integers $$$a_1, a_2, \\dots, a_n$$$ ($$$1 \\le a_i \\le 10^9$$$) — the initial health of corresponding monsters. The third line contains $$$n$$$ integers $$$b_1, b_2, \\dots, b_n$$$ ($$$0 \\le b_i \\le 10^9$$$), where $$$b_i$$$ is the strength of the spell for the $$$i$$$-th monster. It's guaranteed that the sum of $$$n$$$ doesn't exceed $$$2 \\cdot 10^5$$$.",
  "outputFormat": "For each test case, print one integer — the minimum possible total time to kill all monsters.",
  "sampleTests": [
    {
      "input": "4\n1\n10\n0\n3\n100 1 100\n1 100 1\n4\n2 6 7 3\n3 6 0 5\n2\n1000000000 1000000000\n1000000000 1000000000",
      "output": "10\n203\n26\n3000000000"
    }
  ],
  "timeLimit": 2000,
  "memoryLimit": 256,
  "sourceUrl": "https://codeforces.com/problemset/problem/1749/B",
  "verified": true,
  "qualityScore": 4.0,
  "source": "codeforces-scraped"
}