{
  "contestId": 1750,
  "index": "F",
  "name": "Majority",
  "rating": 2700,
  "tags": [
    "implementation"
  ],
  "statement": "Everyone was happy coding, until suddenly a power shortage happened and the best competitive programming site went down. Fortunately, a system administrator bought some new equipment recently, including some UPSs. Thus there are some servers that are still online, but we need all of them to be working in order to keep the round rated. Imagine the servers being a binary string $$$s$$$ of length $$$n$$$. If the $$$i$$$-th server is online, then $$$s_i = 1$$$, and $$$s_i = 0$$$ otherwise. A system administrator can do the following operation called electricity spread , that consists of the following phases: Select two servers at positions $$$1 \\le i < j \\le n$$$ such that both are online (i.e. $$$s_i=s_j=1$$$). The spread starts only from online servers. Check if we have enough power to make the spread. We consider having enough power if the number of turned on servers in range $$$[i, j]$$$ is at least the number of turned off servers in range $$$[i, j]$$$. More formally, check whether $$$2 \\cdot (s_i + s_{i+1} + \\ldots + s_j) \\ge j - i + 1$$$. If the check is positive, turn on all the offline servers in range $$$[i, j]$$$. More formally, make $$$s_k := 1$$$ for all $$$k$$$ from $$$i$$$ to $$$j$$$. We call a binary string $$$s$$$ of length $$$n$$$ rated if we can turn on all servers (i.e. make $$$s_i = 1$$$ for $$$1 \\le i \\le n$$$) using the electricity spread operation any number of times (possibly, $$$0$$$). Your task is to find the number of rated strings of length $$$n$$$ modulo $$$m$$$.",
  "inputFormat": "The first and only line contains two integers $$$n$$$ and $$$m$$$ ($$$1 \\le n \\le 5000$$$, $$$10 \\le m \\le 10^9$$$) — the length of the string and the required module.",
  "outputFormat": "Print a single integer — the number of rated binary strings of length $$$n$$$. Since this number can be large, print it modulo $$$m$$$.",
  "sampleTests": [
    {
      "input": "2 100",
      "output": "1"
    }
  ],
  "timeLimit": 2000,
  "memoryLimit": 1024,
  "sourceUrl": "https://codeforces.com/problemset/problem/1750/F",
  "verified": true,
  "qualityScore": 4.0,
  "source": "codeforces-scraped"
}