{
  "contestId": 1759,
  "index": "D",
  "name": "Make It Round",
  "rating": 1400,
  "tags": [
    "implementation"
  ],
  "statement": "Inflation has occurred in Berlandia, so the store needs to change the price of goods. The current price of good $$$n$$$ is given. It is allowed to increase the price of the good by $$$k$$$ times, with $$$1 \\le k \\le m$$$, k is an integer. Output the roundest possible new price of the good. That is, the one that has the maximum number of zeros at the end. For example, the number 481000 is more round than the number 1000010 (three zeros at the end of 481000 and only one at the end of 1000010 ). If there are several possible variants, output the one in which the new price is maximal. If it is impossible to get a rounder price, output $$$n \\cdot m$$$ (that is, the maximum possible price).",
  "inputFormat": "The first line contains a single integer $$$t$$$ ($$$1 \\le t \\le 10^4$$$) —the number of test cases in the test. Each test case consists of one line. This line contains two integers: $$$n$$$ and $$$m$$$ ($$$1 \\le n, m \\le 10^9$$$). Where $$$n$$$ is the old price of the good, and the number $$$m$$$ means that you can increase the price $$$n$$$ no more than $$$m$$$ times.",
  "outputFormat": "For each test case, output on a separate line the roundest integer of the form $$$n \\cdot k$$$ ($$$1 \\le k \\le m$$$, $$$k$$$ — an integer). If there are several possible variants, output the one in which the new price (value $$$n \\cdot k$$$) is maximal. If it is impossible to get a more rounded price, output $$$n \\cdot m$$$ (that is, the maximum possible price).",
  "sampleTests": [
    {
      "input": "10\n6 11\n5 43\n13 5\n4 16\n10050 12345\n2 6\n4 30\n25 10\n2 81\n1 7",
      "output": "60\n200\n65\n60\n120600000\n10\n100\n200\n100\n7"
    }
  ],
  "timeLimit": 1000,
  "memoryLimit": 256,
  "sourceUrl": "https://codeforces.com/problemset/problem/1759/D",
  "verified": true,
  "qualityScore": 4.0,
  "source": "codeforces-scraped"
}