{
  "contestId": 1811,
  "index": "F",
  "name": "Is It Flower?",
  "rating": 2100,
  "tags": [
    "implementation"
  ],
  "statement": "Vlad found a flowerbed with graphs in his yard and decided to take one for himself. Later he found out that in addition to the usual graphs, $$$k$$$-flowers also grew on that flowerbed. A graph is called a $$$k$$$-flower if it consists of a simple cycle of length $$$k$$$, through each vertex of which passes its own simple cycle of length $$$k$$$ and these cycles do not intersect at the vertices. For example, $$$3$$$-flower looks like this: Note that $$$1$$$-flower and $$$2$$$-flower do not exist, since at least $$$3$$$ vertices are needed to form a cycle. Vlad really liked the structure of the $$$k$$$-flowers and now he wants to find out if he was lucky to take one of them from the flowerbed.",
  "inputFormat": "The first line of input contains the single integer $$$t$$$ ($$$1 \\le t \\le 10^4$$$) — the number of test cases in the test. The descriptions of the cases follow. An empty string is written before each case. The first line of each case contains two integers $$$n$$$ and $$$m$$$ ($$$2 \\le n \\le 2 \\cdot 10^5$$$, $$$1 \\le m \\le \\min(2 \\cdot 10^5, \\frac{n \\cdot (n-1)}{2})$$$) — the number of vertices and edges in the graph, respectively. The next $$$m$$$ lines contain two integers each $$$u$$$ and $$$v$$$ ($$$1 \\le u, v \\le n$$$, $$$u \\ne v$$$) — numbers of vertices connected by an edge. It is guaranteed that the graph does not contain multiple edges and self-loops. It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$2 \\cdot 10^5$$$. It is also guaranteed for the sum of $$$m$$$ over all test cases.",
  "outputFormat": "Output $$$t$$$ lines, each of which is the answer to the corresponding test case. As an answer, output \" YES \" if Vlad's graph is a $$$k$$$-flower for some $$$k$$$, and \" NO \" otherwise. You can output the answer in any case (for example, the strings \" yEs \", \" yes \", \" Yes \" and \" YES \" will be recognized as a positive answer).",
  "sampleTests": [
    {
      "input": "5\n\n9 12\n1 2\n3 1\n2 3\n1 6\n4 1\n6 4\n3 8\n3 5\n5 8\n9 7\n2 9\n7 2\n\n8 12\n1 2\n3 1\n2 3\n1 6\n4 1\n6 4\n3 8\n3 5\n5 8\n8 7\n2 8\n7 2\n\n4 3\n1 2\n4 2\n3 1\n\n6 8\n6 3\n6 4\n5 3\n5 2\n3 2\n3 1\n2 1\n2 4\n\n5 7\n2 4\n2 5\n3 4\n3 5\n4 1\n4 5\n1 5",
      "output": "YES\nNO\nNO\nNO\nNO"
    }
  ],
  "timeLimit": 2000,
  "memoryLimit": 256,
  "sourceUrl": "https://codeforces.com/problemset/problem/1811/F",
  "verified": true,
  "qualityScore": 4.0,
  "source": "codeforces-scraped"
}