{
  "contestId": 1820,
  "index": "A",
  "name": "Yura's New Name",
  "rating": 800,
  "tags": [
    "implementation"
  ],
  "statement": "After holding one team contest, boy Yura got very tired and wanted to change his life and move to Japan. In honor of such a change, Yura changed his name to something nice. Fascinated by this idea he already thought up a name $$$s$$$ consisting only of characters \" _ \" and \" ^ \". But there's a problem — Yura likes smiley faces \" ^_^ \" and \" ^^ \". Therefore any character of the name must be a part of at least one such smiley. Note that only the consecutive characters of the name can be a smiley face. More formally, consider all occurrences of the strings \" ^_^ \" and \" ^^ \" in the string $$$s$$$. Then all such occurrences must cover the whole string $$$s$$$, possibly with intersections. For example, in the string \" ^^__^_^^__^ \" the characters at positions $$$3,4,9,10$$$ and $$$11$$$ are not contained inside any smileys, and the other characters at positions $$$1,2,5,6,7$$$ and $$$8$$$ are contained inside smileys. In one operation Jura can insert one of the characters \" _ \" and \" ^ \" into his name $$$s$$$ (you can insert it at any position in the string). He asks you to tell him the minimum number of operations you need to do to make the name fit Yura's criteria.",
  "inputFormat": "Each test consists of multiple test cases. The first line contains a single integer $$$t$$$ ($$$1 \\le t \\le 100$$$) —the number of test cases. The description of test cases follows. The first and only line of each test case contains a single string $$$s$$$ ($$$1 \\leq |s| \\leq 100$$$), consisting of characters \" _ \" and \" ^ \", — the name to change.",
  "outputFormat": "For each test case, output a single integer — the minimum number of characters you need to add to the name to make it fit for Yura. If you don't need to change anything in the name, print $$$0$$$.",
  "sampleTests": [
    {
      "input": "7\n^______^\n___^_^^^_^___^\n^_\n^\n^_^^^^^_^_^^\n___^^\n_",
      "output": "5\n5\n1\n1\n0\n3\n2"
    }
  ],
  "timeLimit": 1000,
  "memoryLimit": 256,
  "sourceUrl": "https://codeforces.com/problemset/problem/1820/A",
  "verified": true,
  "qualityScore": 4.0,
  "source": "codeforces-scraped"
}