{
  "contestId": 1834,
  "index": "D",
  "name": "Survey in Class",
  "rating": 1900,
  "tags": [
    "implementation"
  ],
  "statement": "Zinaida Viktorovna has $$$n$$$ students in her history class. The homework for today included $$$m$$$ topics, but the students had little time to prepare, so $$$i$$$-th student learned only topics from $$$l_i$$$ to $$$r_i$$$ inclusive. At the beginning of the lesson, each student holds their hand at $$$0$$$. The teacher wants to ask some topics. It goes like this: The teacher asks the topic $$$k$$$. If the student has learned topic $$$k$$$, then he raises his hand by $$$1$$$, otherwise he lower it by $$$1$$$. Each topic Zinaida Viktorovna can ask no more than one time . Find the maximum difference of the heights of the highest and the lowest hand that can be in class after the survey. Note that the student's hand can go below $$$0$$$ .",
  "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\le t \\le 10^4$$$). The description of the test cases follows. The first line of each test case contains two integers $$$n$$$ and $$$m$$$ ($$$2 \\le n \\le 10^5, 1 \\le m \\le 10^9$$$) — the number of students and the number of topics, respectively. Each of the next $$$n$$$ lines of each test case contain two integers $$$l_i$$$ and $$$r_i$$$ ($$$1 \\le l_i \\le r_i \\le m$$$) — the endpoints of the segment of topics that $$$i$$$-th student has learned. It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$10^5$$$.",
  "outputFormat": "For each test case, print one integer — the maximum difference of the heights of the highest and the lowest hand that can be in the class after the survey.",
  "sampleTests": [
    {
      "input": "6\n4 8\n2 6\n4 8\n2 7\n1 5\n3 3\n1 3\n2 3\n2 2\n3 5\n1 5\n1 5\n1 5\n3 5\n1 1\n3 3\n5 5\n4 7\n1 7\n1 3\n3 3\n4 5\n2 4\n1 3\n2 4",
      "output": "6\n4\n0\n2\n12\n2"
    }
  ],
  "timeLimit": 2000,
  "memoryLimit": 256,
  "sourceUrl": "https://codeforces.com/problemset/problem/1834/D",
  "verified": true,
  "qualityScore": 4.0,
  "source": "codeforces-scraped"
}