{
  "contestId": 1834,
  "index": "B",
  "name": "Maximum Strength",
  "rating": 1000,
  "tags": [
    "implementation"
  ],
  "statement": "Fedya is playing a new game called \"The Legend of Link\", in which one of the character's abilities is to combine two materials into one weapon. Each material has its own strength, which can be represented by a positive integer $$$x$$$. The strength of the resulting weapon is determined as the sum of the absolute differences of the digits in the decimal representation of the integers at each position. Formally, let the first material have strength $$$X = \\overline{x_{1}x_{2} \\ldots x_{n}}$$$, and the second material have strength $$$Y = \\overline{y_{1}y_{2} \\ldots y_{n}}$$$. Then the strength of the weapon is calculated as $$$|x_{1} - y_{1}| + |x_{2} - y_{2}| + \\ldots + |x_{n} - y_{n}|$$$. If the integers have different lengths, then the shorter integer is padded with leading zeros . Fedya has an unlimited supply of materials with all possible strengths from $$$L$$$ to $$$R$$$, inclusive. Help him find the maximum possible strength of the weapon he can obtain. An integer $$$C = \\overline{c_{1}c_{2} \\ldots c_{k}}$$$ is defined as an integer obtained by sequentially writing the digits $$$c_1, c_2, \\ldots, c_k$$$ from left to right, i.e. $$$10^{k-1} \\cdot c_1 + 10^{k-2} \\cdot c_2 + \\ldots + c_k$$$.",
  "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\le t \\le 500$$$). The description of the test cases follows. The first line of each test case contains two integers $$$L$$$ and $$$R$$$ ($$$1 \\le L \\le R < 10^{100}$$$) — the decimal representation of the integers representing the minimum and maximum strength of the materials that Fedya has. It is guaranteed that the integers $$$L$$$ and $$$R$$$ do not contain leading zeros. Note that the input data may not fit into standard $$$32$$$-bit or $$$64$$$-bit integer data types.",
  "outputFormat": "For each test case print one integer — the maximum possible strength of the weapon that Fedya can obtain from the given materials.",
  "sampleTests": [
    {
      "input": "6\n53 57\n179 239\n13 37\n132228 132228\n54943329752812629795 55157581939688863366\n88 1914",
      "output": "4\n19\n11\n0\n163\n28"
    }
  ],
  "timeLimit": 1000,
  "memoryLimit": 256,
  "sourceUrl": "https://codeforces.com/problemset/problem/1834/B",
  "verified": true,
  "qualityScore": 4.0,
  "source": "codeforces-scraped"
}