{
  "contestId": 1873,
  "index": "E",
  "name": "Building an Aquarium",
  "rating": 1100,
  "tags": [
    "implementation"
  ],
  "statement": "You love fish, that's why you have decided to build an aquarium. You have a piece of coral made of $$$n$$$ columns, the $$$i$$$-th of which is $$$a_i$$$ units tall. Afterwards, you will build a tank around the coral as follows: Pick an integer $$$h \\geq 1$$$ — the height of the tank. Build walls of height $$$h$$$ on either side of the tank. Then, fill the tank up with water so that the height of each column is $$$h$$$, unless the coral is taller than $$$h$$$; then no water should be added to this column. For example, with $$$a=[3,1,2,4,6,2,5]$$$ and a height of $$$h=4$$$, you will end up using a total of $$$w=8$$$ units of water, as shown. You can use at most $$$x$$$ units of water to fill up the tank, but you want to build the biggest tank possible. What is the largest value of $$$h$$$ you can select?",
  "inputFormat": "The first line contains a single integer $$$t$$$ ($$$1 \\leq t \\leq 10^4$$$) — the number of test cases. The first line of each test case contains two positive integers $$$n$$$ and $$$x$$$ ($$$1 \\leq n \\leq 2 \\cdot 10^5$$$; $$$1 \\leq x \\leq 10^9$$$) — the number of columns of the coral and the maximum amount of water you can use. The second line of each test case contains $$$n$$$ space-separated integers $$$a_i$$$ ($$$1 \\leq a_i \\leq 10^9$$$) — the heights of the coral. The sum of $$$n$$$ over all test cases doesn't exceed $$$2 \\cdot 10^5$$$.",
  "outputFormat": "For each test case, output a single positive integer $$$h$$$ ($$$h \\geq 1$$$) — the maximum height the tank can have, so you need at most $$$x$$$ units of water to fill up the tank. We have a proof that under these constraints, such a value of $$$h$$$ always exists.",
  "sampleTests": [
    {
      "input": "5\n7 9\n3 1 2 4 6 2 5\n3 10\n1 1 1\n4 1\n1 4 3 4\n6 1984\n2 6 5 9 1 8\n1 1000000000\n1",
      "output": "4\n4\n2\n335\n1000000001"
    }
  ],
  "timeLimit": 2000,
  "memoryLimit": 256,
  "sourceUrl": "https://codeforces.com/problemset/problem/1873/E",
  "verified": true,
  "qualityScore": 4.0,
  "source": "codeforces-scraped"
}