{
  "contestId": 1901,
  "index": "E",
  "name": "Compressed Tree",
  "rating": 2200,
  "tags": [
    "implementation"
  ],
  "statement": "You are given a tree consisting of $$$n$$$ vertices. A number is written on each vertex; the number on vertex $$$i$$$ is equal to $$$a_i$$$. You can perform the following operation any number of times (possibly zero): choose a vertex which has at most $$$1$$$ incident edge and remove this vertex from the tree. Note that you can delete all vertices. After all operations are done, you're compressing the tree. The compression process is done as follows. While there is a vertex having exactly $$$2$$$ incident edges in the tree, perform the following operation: delete this vertex, connect its neighbors with an edge. It can be shown that if there are multiple ways to choose a vertex to delete during the compression process, the resulting tree is still the same. Your task is to calculate the maximum possible sum of numbers written on vertices after applying the aforementioned operation any number of times, and then compressing the tree.",
  "inputFormat": "The first line contains a single integer $$$t$$$ ($$$1 \\le t \\le 10^4$$$) — the number of test cases. The first line of each test case contains a single integer $$$n$$$ ($$$2 \\le n \\le 5 \\cdot 10^5$$$) — the number of vertices. The second line contains $$$n$$$ integers $$$a_1, a_2, \\dots, a_n$$$ ($$$-10^9 \\le a_i \\le 10^9$$$). Each of the next $$$n - 1$$$ lines describes an edge of the tree. Edge $$$i$$$ is denoted by two integers $$$v_i$$$ and $$$u_i$$$, the labels of vertices it connects ($$$1 \\le v_i, u_i \\le n$$$, $$$v_i \\ne u_i$$$). These edges form a tree. Additional constraint on the input: the sum of $$$n$$$ over all test cases doesn't exceed $$$5 \\cdot 10^5$$$.",
  "outputFormat": "For each test case, print a single integer — the maximum possible sum of numbers written on vertices after applying the aforementioned operation any number of times, and then compressing the tree.",
  "sampleTests": [
    {
      "input": "3\n4\n1 -2 2 1\n1 2\n3 2\n2 4\n2\n-2 -5\n2 1\n7\n-2 4 -2 3 3 2 -1\n1 2\n2 3\n3 4\n3 5\n4 6\n4 7",
      "output": "3\n0\n9"
    }
  ],
  "timeLimit": 2000,
  "memoryLimit": 256,
  "sourceUrl": "https://codeforces.com/problemset/problem/1901/E",
  "verified": true,
  "qualityScore": 4.0,
  "source": "codeforces-scraped"
}