{
  "contestId": 1914,
  "index": "E2",
  "name": "Game with Marbles (Hard Version)",
  "rating": 1400,
  "tags": [
    "implementation"
  ],
  "statement": "The easy and hard versions of this problem differ only in the constraints on the number of test cases and $$$n$$$. In the hard version, the number of test cases does not exceed $$$10^4$$$, and the sum of values of $$$n$$$ over all test cases does not exceed $$$2 \\cdot 10^5$$$. Furthermore, there are no additional constraints on $$$n$$$ in a single test case. Recently, Alice and Bob were given marbles of $$$n$$$ different colors by their parents. Alice has received $$$a_1$$$ marbles of color $$$1$$$, $$$a_2$$$ marbles of color $$$2$$$,..., $$$a_n$$$ marbles of color $$$n$$$. Bob has received $$$b_1$$$ marbles of color $$$1$$$, $$$b_2$$$ marbles of color $$$2$$$, ..., $$$b_n$$$ marbles of color $$$n$$$. All $$$a_i$$$ and $$$b_i$$$ are between $$$1$$$ and $$$10^9$$$. After some discussion, Alice and Bob came up with the following game: players take turns, starting with Alice. On their turn, a player chooses a color $$$i$$$ such that both players have at least one marble of that color. The player then discards one marble of color $$$i$$$, and their opponent discards all marbles of color $$$i$$$. The game ends when there is no color $$$i$$$ such that both players have at least one marble of that color. The score in the game is the difference between the number of remaining marbles that Alice has and the number of remaining marbles that Bob has at the end of the game. In other words, the score in the game is equal to $$$(A-B)$$$, where $$$A$$$ is the number of marbles Alice has and $$$B$$$ is the number of marbles Bob has at the end of the game. Alice wants to maximize the score, while Bob wants to minimize it. Calculate the score at the end of the game if both players play optimally.",
  "inputFormat": "The first line contains a single integer $$$t$$$ ($$$1 \\le t \\le 10^4$$$) — the number of test cases. Each test case consists of three lines: the first line contains a single integer $$$n$$$ ($$$2 \\le n \\le 2 \\cdot 10^5$$$) — the number of colors; the second line contains $$$n$$$ integers $$$a_1, a_2, \\dots, a_n$$$ ($$$1 \\le a_i \\le 10^9$$$), where $$$a_i$$$ is the number of marbles of the $$$i$$$-th color that Alice has; the third line contains $$$n$$$ integers $$$b_1, b_2, \\dots, b_n$$$ ($$$1 \\le b_i \\le 10^9$$$), where $$$b_i$$$ is the number of marbles of the $$$i$$$-th color that Bob has. Additional constraint on the input: the sum of $$$n$$$ for all test cases does not exceed $$$2 \\cdot 10^5$$$.",
  "outputFormat": "For each test case, output a single integer — the score at the end of the game if both Alice and Bob act optimally.",
  "sampleTests": [
    {
      "input": "5\n3\n4 2 1\n1 2 4\n4\n1 20 1 20\n100 15 10 20\n5\n1000000000 1000000000 1000000000 1000000000 1000000000\n1 1 1 1 1\n3\n5 6 5\n2 1 7\n6\n3 2 4 2 5 5\n9 4 7 9 2 5",
      "output": "1\n-9\n2999999997\n8\n-6"
    }
  ],
  "timeLimit": 3500,
  "memoryLimit": 256,
  "sourceUrl": "https://codeforces.com/problemset/problem/1914/E2",
  "verified": true,
  "qualityScore": 4.0,
  "source": "codeforces-scraped"
}