{
  "contestId": 1946,
  "index": "E",
  "name": "Girl Permutation",
  "rating": 2200,
  "tags": [
    "implementation"
  ],
  "statement": "Some permutation of length $$$n$$$ is guessed. You are given the indices of its prefix maximums and suffix maximums. Recall that a permutation of length $$$k$$$ is an array of size $$$k$$$ such that each integer from $$$1$$$ to $$$k$$$ occurs exactly once. Prefix maximums are the elements that are the maximum on the prefix ending at that element. More formally, the element $$$a_i$$$ is a prefix maximum if $$$a_i > a_j$$$ for every $$$j < i$$$. Similarly, suffix maximums are defined, the element $$$a_i$$$ is a suffix maximum if $$$a_i > a_j$$$ for every $$$j > i$$$. You need to output the number of different permutations that could have been guessed. As this number can be very large, output the answer modulo $$$10^9 + 7$$$.",
  "inputFormat": "Each test consists of several test cases. The first line contains a single integer $$$t$$$ ($$$1 \\le t \\le 10^4$$$) — the number of test cases. Then follows the description of the test cases. The first line of each test case contains three integers $$$n, m_1$$$ and $$$m_2$$$ ($$$1 \\le m_1, m_2 \\le n \\le 2 \\cdot 10^5$$$) — the length of the permutation, the number of prefix maximums, and the number of suffix maximums, respectively. The second line of each test case contains $$$m_1$$$ integers $$$p_1 < p_2 < \\ldots < p_{m_1}$$$ ($$$1 \\le p_i \\le n$$$) — the indices of the prefix maximums in increasing order. The third line of each test case contains $$$m_2$$$ integers $$$s_1 < s_2 < \\ldots < s_{m_2}$$$ ($$$1 \\le s_i \\le n$$$) — the indices of the suffix maximums in increasing order. It is guaranteed that the sum of the values of $$$n$$$ for all test cases does not exceed $$$2 \\cdot 10^5$$$.",
  "outputFormat": "For each test case, output a single integer on a separate line — the number of suitable permutations modulo $$$10^9 + 7$$$.",
  "sampleTests": [
    {
      "input": "6\n1 1 1\n1\n1\n4 2 3\n1 2\n2 3 4\n3 3 1\n1 2 3\n3\n5 3 4\n1 2 3\n2 3 4 5\n20 5 4\n1 2 3 4 12\n12 13 18 20\n6 2 3\n1 3\n3 4 6",
      "output": "1\n3\n1\n0\n317580808\n10"
    }
  ],
  "timeLimit": 2000,
  "memoryLimit": 256,
  "sourceUrl": "https://codeforces.com/problemset/problem/1946/E",
  "verified": true,
  "qualityScore": 4.0,
  "source": "codeforces-scraped"
}