{
  "contestId": 1991,
  "index": "G",
  "name": "Grid Reset",
  "rating": 2700,
  "tags": [
    "implementation"
  ],
  "statement": "You are given a grid consisting of $$$n$$$ rows and $$$m$$$ columns, where each cell is initially white. Additionally, you are given an integer $$$k$$$, where $$$1 \\le k \\le \\min(n, m)$$$. You will process $$$q$$$ operations of two types: $$$\\mathtt{H}$$$ (horizontal operation) — You choose a $$$1 \\times k$$$ rectangle completely within the grid, where all cells in this rectangle are white. Then, all cells in this rectangle are changed to black. $$$\\mathtt{V}$$$ (vertical operation) — You choose a $$$k \\times 1$$$ rectangle completely within the grid, where all cells in this rectangle are white. Then, all cells in this rectangle are changed to black. After each operation, if any rows or columns become completely black, all cells in these rows and columns are simultaneously reset to white. Specifically, if all cells in the row and column a cell is contained in become black, all cells in both the row and column will be reset to white. Choose the rectangles in a way that you can perform all given operations, or determine that it is impossible.",
  "inputFormat": "Each test contains multiple test cases. The first line contains a single integer $$$t$$$ ($$$1 \\le t \\le 1000$$$) — the number of test cases. The description of test cases follows. The first line of each test case contains four integers $$$n$$$, $$$m$$$, $$$k$$$, and $$$q$$$ ($$$1 \\le n, m \\le 100$$$, $$$1 \\le k \\le \\min(n, m)$$$, $$$1 \\le q \\le 1000$$$) — the number of rows and columns in the grid, the size of the operation rectangle, and the number of operations, respectively. The second line of each test case contains a string $$$s$$$ of length $$$q$$$, consisting only of characters $$$\\mathtt{H}$$$ and $$$\\mathtt{V}$$$ — the sequence of operation types. It is guaranteed that the sum of $$$q$$$ over all test cases does not exceed $$$1000$$$.",
  "outputFormat": "For each test case, output a single integer $$$-1$$$ if it is impossible to perform all the operations. Otherwise, output $$$q$$$ lines. Each line contains two integers $$$i$$$, $$$j$$$ ($$$1 \\le i \\le n$$$, $$$1 \\le j \\le m$$$) — the coordinates of the top-left cell of the operation rectangle. If there are multiple solutions, output any of them.",
  "sampleTests": [
    {
      "input": "1\n4 5 3 6\nHVVHHV",
      "output": "1 1\n2 1\n1 1\n2 3\n3 3\n2 2"
    }
  ],
  "timeLimit": 2000,
  "memoryLimit": 256,
  "sourceUrl": "https://codeforces.com/problemset/problem/1991/G",
  "verified": true,
  "qualityScore": 4.0,
  "source": "codeforces-scraped"
}