{
  "contestId": 2049,
  "index": "A",
  "name": "MEX Destruction",
  "rating": 800,
  "tags": [
    "implementation"
  ],
  "statement": "Evirir the dragon snuck into a wizard's castle and found a mysterious contraption, and their playful instincts caused them to play with (destroy) it... Evirir the dragon found an array $$$a_1, a_2, \\ldots, a_n$$$ of $$$n$$$ non-negative integers. In one operation, they can choose a non-empty subarray$$$^{\\text{∗}}$$$ $$$b$$$ of $$$a$$$ and replace it with the integer $$$\\operatorname{mex}(b)$$$$$$^{\\text{†}}$$$. They want to use this operation any number of times to make $$$a$$$ only contain zeros. It can be proven that this is always possible under the problem constraints. What is the minimum number of operations needed? $$$^{\\text{∗}}$$$An array $$$c$$$ is a subarray of an array $$$d$$$ if $$$c$$$ can be obtained from $$$d$$$ by the deletion of several (possibly, zero or all) elements from the beginning and several (possibly, zero or all) elements from the end. $$$^{\\text{†}}$$$The minimum excluded (MEX) of a collection of integers $$$f_1, f_2, \\ldots, f_k$$$ is defined as the smallest non-negative integer $$$x$$$ which does not occur in the collection $$$f$$$.",
  "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\le t \\le 200$$$). The description of the test cases follows. The first line of each test case contains a single integer $$$n$$$ ($$$1 \\le n \\le 50$$$), the length of $$$a$$$. The second line of each test case contains $$$n$$$ space-separated integers, $$$a_1, a_2, \\ldots, a_n$$$ ($$$0 \\le a_i \\le 100$$$). It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$500$$$.",
  "outputFormat": "For each test case, output a single integer on a line, the minimum number of operations needed to make $$$a$$$ contain only zeros.",
  "sampleTests": [
    {
      "input": "10\n4\n0 1 2 3\n6\n0 0 0 0 0 0\n5\n1 0 1 0 1\n5\n3 1 4 1 5\n4\n3 2 1 0\n7\n9 100 0 89 12 2 3\n4\n0 3 9 0\n7\n0 7 0 2 0 7 0\n1\n0\n2\n0 1",
      "output": "1\n0\n2\n1\n1\n2\n1\n2\n0\n1"
    }
  ],
  "timeLimit": 1000,
  "memoryLimit": 256,
  "sourceUrl": "https://codeforces.com/problemset/problem/2049/A",
  "verified": true,
  "qualityScore": 4.0,
  "source": "codeforces-scraped"
}