{
  "contestId": 2055,
  "index": "E",
  "name": "Haystacks",
  "rating": 2800,
  "tags": [
    "implementation"
  ],
  "statement": "On the next new moon, the universe will reset, beginning with Florida. It's up to Florida Man to stop it, but he first needs to find an important item. There are $$$n$$$ haystacks labelled from $$$1$$$ to $$$n$$$, where haystack $$$i$$$ contains $$$a_i$$$ haybales. One of the haystacks has a needle hidden beneath it, but you do not know which one. Your task is to move the haybales so that each haystack is emptied at least once, allowing you to check if the needle is hidden under that particular haystack. However, the process is not that simple. Once a haystack $$$i$$$ is emptied for the first time, it will be assigned a height limit and can no longer contain more than $$$b_i$$$ haybales. More formally, a move is described as follows: Choose two haystacks $$$i$$$ and $$$j$$$. If haystack $$$i$$$ has not been emptied before, or haystack $$$i$$$ contains strictly less than $$$b_i$$$ haybales, you may move exactly $$$1$$$ haybale from haystack $$$j$$$ to haystack $$$i$$$. Note : Before a haystack is emptied, it has no height limit, and you can move as many haybales as you want onto that haystack. Compute the minimum number of moves required to ensure that each haystack is emptied at least once, or report that it is impossible.",
  "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\le t \\le 10^4$$$). The description of the test cases follows. The first line of each test case contains a single integer $$$n$$$ ($$$2\\le n\\le 5\\cdot 10^5$$$) — the number of haystacks. The $$$i$$$-th of the next $$$n$$$ lines contains two integers $$$a_i$$$ and $$$b_i$$$ ($$$1\\le a_i, b_i\\le 10^9$$$) — the initial number of haybales in the $$$i$$$-th haystack, and the height limit that it is assigned after it is emptied for the first time. It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$5 \\cdot 10^5$$$.",
  "outputFormat": "For each test case, print a single integer — the minimum number of moves required to ensure that each haystack is emptied at least once. If it is not possible to empty each haystack at least once, output -1 .",
  "sampleTests": [
    {
      "input": "7\n2\n3 5\n2 4\n2\n10 1\n1 10\n3\n1 3\n4 3\n1 1\n3\n5 4\n2 4\n1 10\n6\n2 1\n3 3\n5 4\n1 5\n1 6\n1 8\n5\n3 2\n1 2\n1 1\n1 3\n6 5\n2\n5 10\n7 12",
      "output": "8\n-1\n8\n9\n14\n15\n19"
    }
  ],
  "timeLimit": 2000,
  "memoryLimit": 256,
  "sourceUrl": "https://codeforces.com/problemset/problem/2055/E",
  "verified": true,
  "qualityScore": 4.0,
  "source": "codeforces-scraped"
}