{
  "contestId": 2096,
  "index": "E",
  "name": "Wonderful Teddy Bears",
  "rating": 2400,
  "tags": [
    "implementation"
  ],
  "statement": "You are the proud owner of $$$n$$$ teddy bears, which are arranged in a row on a shelf. Each teddy bear is colored either black or pink. An arrangement of teddy bears is beautiful if all the black teddy bears are to the left of all the pink teddy bears. In other words, there does not exist a pair of indices $$$(i, j)$$$ ($$$1 \\leq i < j \\leq n$$$) such that the $$$i$$$-th teddy bear is pink, and the $$$j$$$-th teddy bear is black. You want to reorder the teddy bears into a beautiful arrangement. You are too short to reach the shelf, but luckily, you can send instructions to a robot to move the teddy bears around. In a single instruction, the robot can: Choose an index $$$i$$$ ($$$1 \\le i \\le n - 2$$$) and reorder the teddy bears at positions $$$i$$$, $$$i + 1$$$ and $$$i + 2$$$ so that all the black teddy bears are to the left of all the pink teddy bears. What is the minimum number of instructions needed to reorder the teddy bears?",
  "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\le t \\le 10^4$$$). The description of the test cases follows. The first line of each test case contains a single integer $$$n$$$ ($$$3 \\le n \\le 2 \\cdot 10^5$$$) — the number of teddy bears. The second line of each test case contains a single string $$$s$$$ of length $$$n$$$ consisting of characters B and P — the colors of the teddy bears. For each $$$i$$$ from $$$1$$$ to $$$n$$$, the $$$i$$$-th teddy bear is colored black if $$$s_i = \\texttt{B}$$$ and pink if $$$s_i = \\texttt{P}$$$. It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$2 \\cdot 10^5$$$.",
  "outputFormat": "For each test case, output a single integer — the minimum number of instructions needed to reorder the teddy bears.",
  "sampleTests": [
    {
      "input": "5\n3\nPPP\n3\nBPP\n3\nPPB\n7\nPPBPPBB\n15\nBPBPBBBBBPBBBBB",
      "output": "0\n0\n1\n5\n14"
    }
  ],
  "timeLimit": 2000,
  "memoryLimit": 256,
  "sourceUrl": "https://codeforces.com/problemset/problem/2096/E",
  "verified": true,
  "qualityScore": 4.0,
  "source": "codeforces-scraped"
}