{
  "contestId": 2096,
  "index": "B",
  "name": "Wonderful Gloves",
  "rating": 1100,
  "tags": [
    "implementation"
  ],
  "statement": "You are the proud owner of many colorful gloves, and you keep them in a drawer. Each glove is in one of $$$n$$$ colors numbered $$$1$$$ to $$$n$$$. Specifically, for each $$$i$$$ from $$$1$$$ to $$$n$$$, you have $$$l_i$$$ left gloves and $$$r_i$$$ right gloves with color $$$i$$$. Unfortunately, it's late at night, so you can't see any of your gloves . In other words, you will only know the color and the type (left or right) of a glove after you take it out of the drawer. A matching pair of gloves with color $$$i$$$ consists of exactly one left glove and one right glove with color $$$i$$$. Find the minimum number of gloves you need to take out of the drawer to guarantee that you have at least $$$k$$$ matching pairs of gloves with different colors. Formally, find the smallest positive integer $$$x$$$ such that: For any set of $$$x$$$ gloves you take out of the drawer, there will always be at least $$$k$$$ matching pairs of gloves with different colors.",
  "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\le t \\le 10^4$$$). The description of the test cases follows. The first line of each test case contains two integers $$$n$$$, $$$k$$$ ($$$1 \\leq k \\leq n \\leq 2 \\cdot 10^5$$$) — the number of different colors, and the minimum number of required matching pairs of gloves. The second line of each test case contains $$$n$$$ integers $$$l_1, l_2, \\ldots, l_n$$$ ($$$1 \\leq l_i \\leq 10^9$$$) — the number of left gloves with color $$$i$$$ for each $$$i$$$ from $$$1$$$ to $$$n$$$. The third line of each test case contains $$$n$$$ integers $$$r_1, r_2, \\ldots, r_n$$$ ($$$1 \\leq r_i \\leq 10^9$$$) — the number of right gloves with color $$$i$$$ for each $$$i$$$ from $$$1$$$ to $$$n$$$. It is guaranteed that the sum of $$$n$$$ over all test cases does not exceed $$$2 \\cdot 10^5$$$.",
  "outputFormat": "For each test case, output a single integer — the minimum number of gloves you need to take out of the drawer.",
  "sampleTests": [
    {
      "input": "5\n3 3\n1 1 1\n1 1 1\n1 1\n100\n1\n3 2\n100 1 1\n200 1 1\n5 2\n97 59 50 87 36\n95 77 33 13 74\n10 6\n97 59 50 87 36 95 77 33 13 74\n91 14 84 33 54 89 68 34 14 15",
      "output": "6\n101\n303\n481\n1010"
    }
  ],
  "timeLimit": 1000,
  "memoryLimit": 256,
  "sourceUrl": "https://codeforces.com/problemset/problem/2096/B",
  "verified": true,
  "qualityScore": 4.0,
  "source": "codeforces-scraped"
}