{
  "contestId": 2109,
  "index": "A",
  "name": "It's Time To Duel",
  "rating": 800,
  "tags": [
    "implementation"
  ],
  "statement": "Something you may not know about Mouf is that he is a big fan of the Yu-Gi-Oh! card game. He loves to duel with anyone he meets. To gather all fans who love to play as well, he decided to organize a big Yu-Gi-Oh! tournament and invited $$$n$$$ players. Mouf arranged the $$$n$$$ players in a line, numbered from $$$1$$$ to $$$n$$$. They then held $$$n - 1$$$ consecutive duels: for each $$$i$$$ from $$$1$$$ to $$$n - 1$$$, player $$$i$$$ faced player $$$i + 1$$$, producing one winner and one loser per match. Afterward, each player reports a value $$$a_i(0 \\le a_i \\le 1)$$$: $$$0$$$ indicating they won no duels; $$$1$$$ indicating they won at least one duel. Since some may lie about their results (e.g., reporting a $$$1$$$ instead of a $$$0$$$, or vice versa) to influence prize outcomes, Mouf will cancel the tournament if he can prove any report to be false. Given the array $$$a$$$, determine whether at least one player must be lying.",
  "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $$$t$$$ ($$$1 \\le t \\le 100$$$). The description of the test cases follows. The first line of each test case contains one integer $$$n$$$ ($$$2 \\le n \\le 100$$$) — the number of players in the tournament. The second line of each test case contains $$$n$$$ integers $$$a_1, a_2, \\ldots, a_n$$$ ($$$0 \\le a_i \\le 1$$$) — denoting the report of the $$$i$$$-th player.",
  "outputFormat": "For each test case, print \"YES\" (without quotes) if there is at least one liar among the players, and \"NO\" (without quotes) otherwise. You can output the answer in any case (upper or lower). For example, the strings \"yEs\" , \"yes\" , \"Yes\" , and \"YES\" will be recognized as positive responses.",
  "sampleTests": [
    {
      "input": "6\n3\n0 1 0\n2\n0 0\n2\n1 1\n4\n0 1 1 1\n4\n1 0 0 1\n7\n0 1 0 1 0 1 0",
      "output": "NO\nYES\nYES\nNO\nYES\nNO"
    }
  ],
  "timeLimit": 1000,
  "memoryLimit": 256,
  "sourceUrl": "https://codeforces.com/problemset/problem/2109/A",
  "verified": true,
  "qualityScore": 4.0,
  "source": "codeforces-scraped"
}